In [1]:
import pandas as pd

In [2]:
titanic_df=pd.read_csv('titanic-data.csv')

In [3]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [6]:
titanic_df.rename({
    'Pclass': 'PStatus', 'Sex': 'Gender'}, axis =1, inplace = True)

In [7]:
titanic_df.head(3)

,PassengerId,Survived,PStatus,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## handling incorrect data

In [13]:
import numpy as np

In [21]:
data =pd.DataFrame({
    'id':[1,3,5,7,9],
    'name':['John', 'jennifer', 'Ram', 'Hari', 'shayam'],
    'age':[12,34,47,22,-43],
    'gender':['M','F', 2, 'F', 'Z'],
    'income':[300,500,np.nan,300,400]
    
}
    
)

In [22]:
data

   id      name  age gender  income
0   1      John   12      M   300.0
1   3  jennifer   34      F   500.0
2   5       Ram   47      2     NaN
3   7      Hari   22      F   300.0
4   9    shayam  -43      Z   400.0

In [23]:
data.dtypes

id          int64
name       object
age         int64
gender     object
income    float64
dtype: object

In [32]:
data.age= data.age.astype('int8')

## sample boundary

In [33]:
filter_age= (data.age >18) & (data.age<=45)

In [34]:
filter_age

0    False
1     True
2    False
3     True
4    False
Name: age, dtype: bool

In [37]:
data.age=abs(data.age)
data

   id      name  age gender  income
0   1      John   12      M   300.0
1   3  jennifer   34      F   500.0
2   5       Ram   47      2     NaN
3   7      Hari   22      F   300.0
4   9    shayam   43      Z   400.0

In [40]:
data[data.gender.isin(['M','F'])]

   id      name  age gender  income
0   1      John   12      M   300.0
1   3  jennifer   34      F   500.0
3   7      Hari   22      F   300.0

## saving a dataframe

In [43]:
titanic_df.to_csv("clean-data.csv", index= False)

In [44]:
titanic_df.to_json("clean-data.json", index= False, orient= 'records')